Repository: smc/fuel
Catalog: mobile/fuel-mobile-*-anish.po
Languages: ml

source: 12 Hour
ml: 12 മണിക്കൂര്‍

source: 24 Hour
ml: 24 മണിക്കൂര്‍

source: About Application
ml: അപ്പ്ലിക്കേഷനെ കുറിച്ച്

source: Accessibility
ml: പ്രാപ്യമായവ

source: Activate
ml: സജീവമാക്കുക

source: Activate Handset
ml: ഹസ്തോപകരണം സജീവമാക്കുക

source: Add Bookmark
ml: അടയാളക്കുറിപ്പ് ചേര്‍ക്കുക

source: Add Contact
ml: ബന്ധങ്ങളെ ചേര്‍ക്കുക

source: Add New
ml: പുതിയവ ചേര്‍ക്കൂ

source: Add New Device
ml: പുതിയ ഉപകരണം ചേര്‍ക്കുക

source: Add to Album
ml: ആല്‍ബത്തിലേക്ക് ചേര്‍ക്കുക

source: Add to Contact
ml: ബന്ധത്തിലേക്ക് ചേര്‍ക്കുക

source: Add to Home Screen
ml: പൂമുഖത്തേയ്ക്ക് വെയ്ക്കുക

source: Add to Playlist
ml: പണിച്ചാര്‍ത്തിലേയ്ക്ക് ചേര്‍ക്കുക

source: Advanced
ml: വികസിതമായ

source: Airplane Mode
ml: വിമാനമട്ട്

source: Alarm Clock
ml: അലാറം ഘടികാരം

source: Alarm Off
ml: അലാറം നിർത്തൂ

source: Alarm On
ml: അലാറം വെയ്ക്കു

source: Alarm Once
ml: അലാറം ഒരുതവണ

source: Alarm Time
ml: അലാറം സമയം

source: Alarm Tone
ml: അലാറം ധ്വനി

source: Album
ml: ആല്‍ബം

source: All
ml: എല്ലാം

source: All at Once
ml: എല്ലാമൊരുമിച്ച്

source: All Read
ml: എല്ലാ വായിച്ചതും

source: All Ringtones
ml: എല്ലാ റിങ്ങ്ടോണും

source: All Songs
ml: എല്ലാ ഗാനങ്ങളും

source: Answer Call
ml: കോള്‍ എടുക്കു

source: Application Manager
ml: പ്രവര്‍ത്തകപാലകന്‍

source: Area
ml: സ്ഥലം

source: Area Code
ml: സ്ഥലകോഡ്

source: Artist
ml: കലാകാരൻ

source: Artists and Albums
ml: കലാകാരന്മാരും ആല്‍ബങ്ങളും

source: Ascending
ml: ആരോഹണത്തില്‍

source: Auto
ml: സ്വയം

source: Auto-update of Date and Time
ml: തിയതിയും സമയവും സ്വയം പുതുക്കുക

source: Automatic
ml: സ്വയമായി

source: Automatic Keyguard
ml: സ്വയമായ കീപൂട്ട്

source: Automatic Redial
ml: സ്വയമായി വീണ്ടും വിളിക്കുക

source: Automatic Retrieval
ml: സ്വയം വീണ്ടെടുക്കുക

source: Back
ml: പുറകോട്ട്

source: Backlight Timeout
ml: പിന്‍വെളിച്ചം കെടുത്തേണ്ടത്

source: Battery
ml: ബാറ്ററി

source: Beep Once
ml: ഒരിക്കല്‍ ശബ്ദിയ്ക്കുക

source: Block Popup
ml: പൊട്ടിവിടരല്‍ തടയുക

source: Bluetooth
ml: ബ്ലൂടൂത്ത്

source: Bookmarks
ml: അടയാളകുറിപ്പ്

source: Brightness
ml: തെളിച്ചം

source: Calculator
ml: ഗണനി

source: Calendar
ml: കലണ്ടര്‍

source: Call Barring
ml: വിളി നിരോധനം

source: Call Divert
ml: വിളി തിരിച്ചുവിടല്‍

source: Call Duration
ml: വിളിദൈര്‍ഘ്യം

source: Call Log
ml: വിളിയുടെ നാൾവഴി

source: Call Settings
ml: വിളി ക്രമീകരണങ്ങള്‍

source: Call Summary
ml: വിളി ചുരുക്കുത്തില്‍

source: Call Timers
ml: വിളിയുടെ സമയം

source: Call Trackers
ml: വിളി സൂചിക

source: Call Waiting
ml: വിളി കാത്തുനിൽക്കുന്നു

source: Camera
ml: ക്യാമറ

source: Cancel
ml: റദ്ദാക്കുക

source: Cancel All Barrings
ml: എല്ലാ നിരോധനങ്ങളും കളയുക

source: Capture
ml: രേഖപ്പെടുത്തുക

source: Carrier
ml: സേവനദാതാവ്

source: Cell Info Display
ml: ഉപകരണ വിവരം

source: Change Access Codes
ml: പ്രവേശനകോഡ് മാറ്റുക

source: Change Barring Password
ml: നിരോധന രഹസ്യവാക്ക് മാറ്റുക

source: Change Codes
ml: കോഡുകള്‍ മാറ്റുക

source: Change PIN Code
ml: പിന്‍ കോഡ് മാറ്റുക

source: Change Security Codes
ml: സുരക്ഷാ കോഡുകള്‍ മാറ്റുക

source: Change Wall Paper
ml: ചുവര്‍ചിത്രങ്ങള്‍ മാറ്റുക

source: Chat
ml: സല്ലാപം

source: Check Status
ml: സ്ഥിതി പരിശോധിക്കുക

source: Classic Clock
ml: സാധാരണ ഘടികാരം

source: Clear Counter
ml: സൂചികകൾ അടിസ്ഥാനസ്ഥിതിയിലാക്കുക

source: Clear Log
ml: നാൾവഴി അടിസ്ഥാനസ്ഥിതിയിലാക്കുക

source: Clear Private Data
ml: എല്ലാ സ്വകാര്യ വിവരങ്ങളും വെടിപ്പാക്കുക

source: Clear Text
ml: വാചകം മായ്ക്കുക

source: Clear Timers
ml: സമയസൂചികകള്‍ മായ്ക്കുക

source: Clock
ml: ഘടികാരം

source: Closed User Group
ml: അടഞ്ഞ ഉപയോക്തൃഗണം

source: Closeup
ml: അടുത്ത്

source: Color Schemes
ml: വർണ്ണവിതാനം

source: Compose Email
ml: ഇമെയില്‍ രചിക്കൂ

source: Compose Text Message
ml: പുതിയ സന്ദേശം

source: Conference Call
ml: കൂട്ട വിളി

source: Confirm
ml: ഉറപ്പ് വരുത്തുക

source: Confirm Delivery
ml: സമര്‍പ്പണം ഉറപ്പാക്കുക

source: Confirm Read
ml: വായിച്ചത് ഉറപ്പാക്കുക

source: Confirm SIM Service Action
ml: സിം സേവനങ്ങളുടെ പ്രവൃത്തി ഉറപ്പാക്കുക

source: Confirmations
ml: ഉറപ്പാക്കലുകള്‍

source: Contact Images
ml: ബന്ധുവിന്‍റെ ചിത്രങ്ങള്‍

source: Contact Name
ml: ബന്ധുവിന്‍റെ പേര്

source: Contacts
ml: ബന്ധുക്കള്‍

source: Converter
ml: പരിവർത്തകൻ

source: Copy
ml: പകര്‍ത്തുക

source: Copy Location
ml: സ്ഥലം പകര്‍ത്തുക

source: Cost Control
ml: മൂല്യ നിയന്ത്രണം

source: Cost Settings
ml: തുക ക്രമീകരണങ്ങള്‍

source: Create Message
ml: പുതിയ സന്ദേശം നിര്‍മ്മിക്കുക

source: Currency
ml: നാണ്യം

source: Data Services
ml: ഡാറ്റ സേവനങ്ങള്‍

source: Date Setting
ml: തിയതി ക്രമീകരണം

source: Default
ml: സ്വതവേയുള്ളവ

source: Default Call Volume
ml: സ്വതവേയുള്ള വിളിയുടെ ശബ്ദം

source: Default Font Size
ml: അക്ഷരത്തിന്റെ സ്വതവേയുള്ള വലിപ്പം

source: Default Text Encoding
ml: സ്വതേയുള്ള അക്ഷര എൻകോഡിങ്ങ്

source: Delete
ml: നീക്കം ചെയ്യുക

source: Delete Messages
ml: സന്ദേശങ്ങള്‍ നീക്കം ചെയ്യുക

source: Delete Recent Call Lists
ml: അടുത്തിടെയുള്ള വിളിയുടെ നാൾവഴി നീക്കം ചെയ്യുക

source: Delivery Reports
ml: സമര്‍പ്പണ റിപ്പോര്‍ട്ടുകള്‍

source: Device Update
ml: ഉപകരണം പുതുക്കല്‍

source: Dialed
ml: അങ്ങോട്ട് വിളിച്ചവ

source: Dialed Numbers
ml: വിളിച്ച ആളുകൾ

source: Dictionary
ml: നിഘണ്ടു

source: Dictionary Off
ml: നിഘണ്ടു അടയ്ക്കുക

source: Digital Clock
ml: ഡിജിറ്റല്‍ ഘടികാരം

source: Digital Zoom
ml: ഡിജിറ്റല്‍ വലുതാക്കല്‍

source: Discoverable
ml: കണ്ടുപിടിക്കാനാവുന്ന

source: Discreet
ml: ശ്രദ്ധയാര്‍ന്ന

source: Display Detail
ml: വിശദാംശങ്ങള്‍ കാണിക്കുക

source: Display Language
ml: കാണിക്കേണ്ട ഭാഷ

source: Display Settings
ml: കാഴ്ച ക്രമീകരണങ്ങള്‍

source: Distribution List
ml: വിതരണ പട്ടിക

source: Divert All Voice Calls
ml: എല്ലാ ശബ്ദ വിളികളും തിരിച്ച് വിടുക

source: Download Image Automatically
ml: സ്വമേധയാ ചിത്രം എടുക്കുക

source: Drafts
ml: കരടുകള്‍

source: Duration
ml: ദൈര്‍ഘ്യം

source: Duration of All Calls
ml: എല്ലാ വിളികളുടെയും ദൈര്‍ഘ്യം

source: Duration of Dialed Calls
ml: അങ്ങോട്ട് വിളിച്ച വിളികളുടെ ദൈര്‍ഘ്യം

source: Duration of Last Calls
ml: അവസാന വിളികളുടെ ദൈര്‍ഘ്യം

source: Duration of Received Calls
ml: സ്വീകരിച്ച വിളികളുടെ ദൈര്‍ഘ്യം

source: Edit
ml: മാറ്റം വരുത്തുക

source: Email Account Management
ml: ഇമെയില്‍ അക്കൌണ്ട് പരിപാലനം

source: Email Filters
ml: ഇമെയില്‍ അരിപ്പകള്‍

source: Enable Bluetooth
ml: ബ്ലൂടൂത് സജ്ജമാക്കുക

source: Enable Geo Location
ml: ജിയോലൊക്കേഷൻ സജീവമാക്കുക

source: Enable HTML Email
ml: എച്ടിഎംഎല്‍ ഇമെയില്‍ സജ്ജമാക്കുക

source: Encryption
ml: ഗൂഢവല്‍ക്കരിക്കുക

source: Enhancement
ml: വികസിപ്പിയ്ക്കുക

source: Enhancement Settings
ml: വികസിപ്പിക്കുന്നതിന്‍റെ ക്രമീകരണങ്ങൾ

source: Enter PIN Code
ml: പിന്‍ കോഡ് നല്‍കുക

source: Enter Recipient
ml: സ്വീകര്‍ത്താവിനെ ചേര്‍ക്കുക

source: Equalizer
ml: സമാനതനിയന്ത്രകന്‍

source: Erase All Contents and Settings
ml: എല്ലാ വിവരങ്ങളും ക്രമീകരണങ്ങളും മായ്ക്കുക

source: Events Notified
ml: അറിയിച്ച സംഭവങ്ങള്‍

source: Exit
ml: പുറത്ത് പോവുക

source: Exit Editor
ml: തിരുത്തില്‍ നിന്ന് പുറത്ത് കടക്കുക

source: Extra Large Fonts
ml: വളരെ വലിയ അക്ഷരങ്ങള്‍

source: Extras
ml: അധികങ്ങള്‍

source: Facebook
ml: ഫേസ്ബുക്ക്

source: Files
ml: ഫയലുകള്‍

source: File Manager
ml: ഫയല്‍ പരിപാലകന്‍

source: Find Location
ml: സ്ഥലം കണ്ടെത്തുക

source: Firewall
ml: തീഭിത്തി

source: Fixed Dialing
ml: സ്ഥിര ഡയലിങ്ങ്

source: Flash
ml: മിന്നല്‍

source: Flash Light
ml: മിന്നല്‍പിണര്‍

source: FM Transmitter
ml: എഫ്.എം. ട്രാൻസ്മിറ്റർ

source: Font Size
ml: അക്ഷരത്തിന്റെ വലിപ്പം

source: Format
ml: ഫോര്‍മാറ്റ്

source: Forward
ml: കൈമാറുക

source: Free Memory
ml: ഉപയോഗത്തിലില്ലാത്ത മെമ്മറി

source: Full
ml: നിറഞ്ഞു

source: Game Sound
ml: കളിയുടെ ശബ്ദം

source: Games
ml: കളികള്‍

source: General
ml: പൊതുവായ

source: Genres
ml: വിഭാഗങ്ങള്‍

source: Get Directions
ml: വഴി കാണിക്കുക

source: Go to
ml: പോവുക

source: Go to Date
ml: തീയതിയിലേക്ക് പോവുക

source: Go to Music Store
ml: പാട്ട് കടയിലേക്ക് പോവുക

source: Google
ml: ഗൂഗിള്‍

source: Grid View
ml: ഗ്രിഡ് കാഴ്ച്ച

source: Handsfree
ml: സതന്ത്രഹസ്തം

source: Headset
ml: ഹെഡ്സെറ്റ്

source: Hide Clock
ml: ഘടികാരം മറയ്ക്കുക

source: History
ml: നാൾവഴി

source: Home
ml: പൂമുഖം

source: Image Size
ml: ചിത്രത്തിന്റെ വലിപ്പം

source: Import Pictures
ml: ഫോട്ടോകള്‍ ഇറക്കുമതി ചെയ്യുക

source: In Car
ml: കാറില്‍

source: In-call Timer
ml: വരുന്ന വിളികളുടെ സമയവിവരം

source: Inbox
ml: ഇന്‍ബോക്സ്

source: In-call Settings
ml: വരുന്ന വിളികളുടെ ക്രമീകരണങ്ങൾ

source: Include Signature
ml: ഒപ്പ് ചേര്‍ക്കുക

source: Incoming Calls
ml: ഇങ്ങോട്ടു് വന്ന വിളികള്‍

source: Info Service
ml: വിജ്ഞാപനസേവനങ്ങള്‍

source: Insert Number
ml: സംഖ്യ ചേര്‍ക്കുക

source: Insert Options
ml: ഐച്ഛികം ചേര്‍ക്കുക

source: Insert Smiley
ml: ചിരി ചേര്‍ക്കുക

source: Insert Symbol
ml: ചിഹ്നം ചേര്‍ക്കുക

source: Insert Template
ml: അച്ച് ചേര്‍ക്കുക

source: Installation Files
ml: സ്ഥാപന ഫയലുകള്‍

source: Installation Settings
ml: സ്ഥാപന ക്രമീകരണങ്ങള്‍

source: Installed Apps
ml: സ്ഥാപിച്ച സംയോജകങ്ങള്‍

source: Instructions
ml: നിര്‍ദ്ദേശങ്ങള്‍

source: International Calls
ml: അന്താരാഷ്ട്ര വിളികള്‍

source: IP Address
ml: ഐപി വിലാസം

source: Keyguard Code
ml: കീപൂട്ട് കോഡ്

source: Keyguard Settings
ml: കീപൂട്ട് സജ്ജീകരണങ്ങള്‍

source: Keylock
ml: കീപാഡ് സജീവം

source: Keypad Locked
ml: കീപാഡ് പൂട്ടിയിരിക്കുന്നു

source: Keypad Tones
ml: കീപാഡ് ശബ്ദങ്ങള്‍

source: Keypad Unlocked
ml: കീപാഡ് തുറന്നു

source: Landscape
ml: തിരശ്ചീനം

source: Language
ml: ഭാഷ

source: Large Fonts
ml: വലിയ അക്ഷരങ്ങള്‍

source: Last Call
ml: അവസാന വിളി

source: Last Watched
ml: അവസാനം കണ്ടത്

source: Latest Update
ml: ഏറ്റവുംഅവസാനത്തെ പുതുക്കല്‍

source: Length
ml: ദൈര്‍ഘ്യം

source: Lights Only
ml: പ്രകാശം മാത്രം

source: List
ml: പട്ടിക

source: List View
ml: പട്ടിക കാഴ്ച

source: Load Image
ml: ചിത്രം എടുക്കുക

source: Location
ml: സ്ഥലം

source: Location Services
ml: സ്ഥല സേവനങ്ങള്‍

source: Lock
ml: പൂട്ട്

source: Loud
ml: ഉച്ചത്തിലുള്ളത്

source: Loudness
ml: ശബ്ദതീവ്രത

source: Manual
ml: കൈകൊണ്ട്

source: Maps
ml: ഭൂപടങ്ങള്‍

source: Media
ml: മാധ്യമം

source: Media Player
ml: മാധ്യമ വാദകന്‍

source: Meeting
ml: യോഗം

source: Memory Status
ml: മെമ്മറിയുടെ സ്ഥിതി

source: Menu
ml: ഐച്ഛികം

source: Menu View
ml: ഐച്ഛിക കാഴ്ച്ച

source: Message Alert Tone
ml: സന്ദേശ അറിയിപ്പ് ശബ്ദം

source: Message Counter
ml: സന്ദേശത്തിന്റെ എണ്ണം

source: Message Notifiers
ml: സന്ദേശ അറിയിപ്പുകള്‍

source: Message Saved
ml: സന്ദേശം സൂക്ഷിച്ചു

source: Message Settings
ml: സന്ദേശ ക്രമീകരണങ്ങള്‍

source: Messages
ml: സന്ദേശങ്ങള്‍

source: Missed
ml: എടുക്കാന്‍ പറ്റാത്ത

source: Missed Calls
ml: എടുക്കാന്‍ പറ്റാഞ്ഞ വിളികള്‍

source: MMS
ml: മൾട്ടിമീഡിയ സന്ദേശം

source: Mobile Network
ml: മൊബൈല്‍ ശൃംഖല

source: Model
ml: മാതൃക

source: More
ml: കൂടുതല്‍

source: Music Library
ml: സംഗീത ശേഖരം

source: Music Player
ml: പാട്ടുപെട്ടി

source: My Location
ml: എന്റെ സ്ഥലം

source: Name
ml: പേരു്

source: Name and Number
ml: പേരും സംഖ്യയും

source: Name List
ml: പേര് പട്ടിക

source: Name Only
ml: പേര് മാത്രം

source: Navigate to Here
ml: ഇവിടേയ്ക്കുള്ള വഴി കാണിക്കുക

source: Network and Connection
ml: ശൃംഖലയും ബന്ധവും

source: Network Selection
ml: ശൃംഖല തെരഞ്ഞെടുക്കുക

source: New Appointment
ml: പുതിയ സന്ദര്‍ശനം

source: Next
ml: അടുത്തത്

source: Night
ml: രാത്രി

source: No
ml: വേണ്ട

source: No Screening
ml: അരിപ്പ വേണ്ട

source: None
ml: ഒന്നുമില്ല

source: Normal
ml: സാധാരണ

source: Note
ml: കുറിപ്പ്

source: Notification Lights
ml: അറിയിപ്പ് വെളിച്ചങ്ങള്‍

source: Now Playing...
ml: ഇപ്പോള്‍ ഓടുന്നത്...

source: Now Press *
ml: ഇപ്പോള്‍ * അമര്‍ത്തുക

source: Number of Copies
ml: പതിപ്പുകളുടെ എണ്ണം

source: Numbers
ml: സംഖ്യകള്‍

source: Office
ml: കാര്യാലയം

source: OK
ml: ശരി

source: On
ml: ഓണ്‍ ആക്കുക

source: One by One
ml: ഓരോന്നായി

source: Options
ml: ഐച്ഛികങ്ങള്‍

source: Organize
ml: ക്രമീകരിക്കുക

source: Other Video Clips
ml: മറ്റുള്ള ചലചിത്ര ശകലങ്ങള്‍

source: Outdoors
ml: പുറത്ത്

source: Outgoing Calls
ml: പുറത്തേക്ക് വിളിച്ച വിളികള്‍

source: Passcode Lock
ml: രഹസ്യവാക്ക് പൂട്ട്

source: Password
ml: രഹസ്യവാക്ക്

source: Paste
ml: ഒട്ടിക്കുക

source: Phone
ml: ഫോണ്‍

source: Phone Management
ml: ഫോണ്‍ നടത്തിപ്പ്

source: Phone Number
ml: ഫോണ്‍ നമ്പര്‍

source: Phone Settings
ml: ഫോണ്‍ ക്രമീകരണങ്ങള്‍

source: Phone-book Style
ml: ഫോണ്‍ബുക്ക് രീതി

source: Picture Messages
ml: ചിത്ര സന്ദേശങ്ങള്‍

source: Picture Review
ml: ചിത്രം അവലോകനം

source: PIN Code Request
ml: PIN കോട് ആവശ്യപ്പെടല്‍

source: Play
ml: വാദനം

source: Playlists
ml: വാദനപട്ടിക

source: Please Call
ml: ദയവായി വിളിക്കൂ

source: Podcast
ml: പോഡ്കാസ്റ്റ്

source: Portrait
ml: ലംബം

source: Power Off
ml: വൈദ്യുതി നിര്‍ത്തുക

source: Power Saving
ml: ഊര്‍ജ്ജ സംരക്ഷണം

source: Prepaid Credit
ml: മുന്‍കൂര്‍ സമ്പാദ്യം

source: Previous
ml: മുമ്പത്തെ

source: Print
ml: അച്ചടി

source: Product Code
ml: ഉല്‍പന്ന കോഡ്

source: Profile
ml: രൂപരേഖ

source: Properties
ml: സവിശേഷതകള്‍

source: Quit
ml: രാജിവെയ്ക്കുക

source: Radio
ml: റേഡിയോ

source: Read
ml: വായിച്ചവ

source: Received
ml: ലഭ്യമായവ

source: Received Calls
ml: ഇങ്ങോട്ടു് വന്ന വിളികള്‍

source: Received Messages
ml: കിട്ടിയ സന്ദേശങ്ങള്‍

source: Recently Visited Page
ml: അടുത്തതായി സന്ദര്‍ശിച്ച താള്‍

source: Reduced
ml: കുറച്ചത്

source: Refresh Library
ml: ശേഖരം പുതുക്കുക

source: Remind About
ml: ഓർമ്മിപ്പിക്കുക

source: Reminders
ml: ഓര്‍മ്മപ്പെടുത്തലുകള്‍

source: Remove from Album
ml: ആല്‍ബത്തില്‍ നിന്ന് നീക്കംചെയ്യുക

source: Repeat
ml: ആവര്‍ത്തിക്കുക

source: Repeat Alarm
ml: അലാറം വീണ്ടും

source: Repeat All
ml: എല്ലാം ആവര്‍ത്തിക്കുക

source: Repeat Song
ml: പാട്ട് ആവര്‍ത്തിക്കുക

source: Reply
ml: മറുപടി

source: Reply to All
ml: എല്ലാവര്‍ക്കും മറുപടി

source: Reset All Settings
ml: എല്ലാ ക്രമീകരണങ്ങലും പഴയപോലാക്കുക

source: Reset Home Screen Layout
ml: ആസ്ഥാന സ്ക്രീന്‍ അവസ്ഥ പഴയപോലാക്കുക

source: Reset Keyboard Dictionary
ml: കീബോഡ് നിഘണ്ടു പഴയപോലാക്കുക

source: Reset Location Warning
ml: സ്ഥല മുന്നറിയിപ്പു് പഴയപോലാക്കുക

source: Reset Network Settings
ml: ശൃംഖലാ ക്രമീകരണങ്ങള്‍ പഴയപോലാക്കുക

source: Reset Settings
ml: ക്രമീകരണങ്ങള്‍ പഴയപോലാക്കുക

source: Resolution
ml: ദൃശ്യസൂക്ഷ്മത

source: Restore Factory Settings
ml: ഫാക്ടറി ക്രമീകരണത്തിലേക്ക് മാറ്റുക

source: Right Selection Key
ml: വലത് കീ

source: Ringing Tone
ml: റിങ്ങ് ശബ്ദം

source: Ringing Volume
ml: റിങ്ങിങ് ഒച്ച

source: Save
ml: സൂക്ഷിക്കുക

source: Save Message
ml: സന്ദേശം സംരക്ഷിക്കുക

source: Screen Display
ml: സ്ക്രീനിലെ കാഴ്ച

source: Screen Rotation
ml: സ്ക്രീന്‍ കറക്കം

source: Screen Saver
ml: സ്ക്രീന്‍ സേവര്‍

source: Search
ml: തെരയുക

source: Search by Sender
ml: അയച്ചയാള്‍ വെച്ച് തെരയുക

source: Search by Subject
ml: വിഷയം വെച്ച് തെരയുക

source: Security
ml: സുരക്ഷ

source: Security Codes
ml: സുരക്ഷ കോഡ്

source: Security Levels
ml: സുരക്ഷ തലങ്ങള്‍

source: Security Settings
ml: സുരക്ഷാക്രമീകരണങ്ങള്‍

source: Select
ml: തെരഞ്ഞെടുക്കുക

source: Select Option
ml: ഐച്ഛികം തെരഞ്ഞെടുക്കുക

source: Send
ml: അയയ്ക്കുക

source: Send Contact Card
ml: വിലാസ കാര്‍ഡ് അയയ്ക്കുക

source: Send Later
ml: പിന്നീട് അയയ്ക്കുക

source: Send Location
ml: സ്ഥലം അയയ്ക്കുക

source: Send to List
ml: പട്ടികയിലേക്ക് അയയ്ക്കുക

source: Send to Many
ml: പലര്‍ക്ക് അയയ്ക്കുക

source: Sender
ml: അയചയാള്‍

source: Sending Options
ml: അയയ്ക്കല്‍ ഐച്ഛികം

source: Sending Profile
ml: അയക്കല്‍ പ്രൊഫൈല്‍

source: Sensor Settings
ml: സെന്‍സര്‍ ക്രമീകരണങ്ങള്‍

source: Sent
ml: അയച്ചവ

source: Sent Items
ml: അയച്ച ഇനങ്ങള്‍

source: Sent Messages
ml: അയച്ച സന്ദേശങ്ങള്‍

source: Service Center
ml: സേവന കേന്ദ്രം

source: Service Not Active
ml: സേവനം ലഭ്യമല്ല

source: Service Status
ml: സേവനത്തിന്റെ സ്ഥിതി

source: Set as Ring Tone
ml: റിങ്ങ്ടോണാക്കി ക്രമീകരിക്കുക

source: Set the Time
ml: സമയം ക്രമീകരിക്കുക

source: Settings
ml: ക്രമീകരണങ്ങള്‍

source: Shuffle
ml: കശക്കുക

source: Shutdown
ml: അടച്ചുപൂട്ടുക

source: Signal
ml: സിഗ്നല്‍

source: Signature
ml: ഒപ്പ്

source: Silent
ml: ശബ്ദരഹിതം

source: SIM Card
ml: സിം കാര്‍ഡ്

source: Slide Show
ml: സ്ലൈഡ് കാണിക്കുക

source: Small Fonts
ml: ചെറിയ അക്ഷരങ്ങള്‍

source: Smileys
ml: ചിരികള്‍

source: SMS
ml: എസ്എംഎസ്

source: Software Update
ml: സോഫ്റ്റ്‌വെയര്‍ പരിഷ്കാരം

source: Software Version
ml: സോഫ്റ്റ്വെയര്‍ പതിപ്പ്

source: Song Details
ml: പാട്ടിന്റെ വിവരങ്ങള്‍

source: Songs
ml: പാട്ടുകള്‍

source: Sound and Ringtone
ml: ശബ്ദവും റിങ്ങ്ടോണും

source: Speaking
ml: സംസാരിക്കുന്നു

source: Special
ml: പ്രത്യേകം

source: Speed Dialing
ml: വേഗ ഡയല്‍

source: Spell Check
ml: അക്ഷരത്തെറ്റ് പരിശോധന

source: Sports
ml: കായികം

source: Spreadsheet
ml: സ്പ്രെഡ്ഷീറ്റ്

source: Standard
ml: ഏകികൃതം

source: Start
ml: തുടക്കം

source: Startup Tone
ml: തുടക്കത്തിലെ ശബ്ദം

source: Startup Page
ml: തുടക്കത്തിലെ പേജ്

source: Stop
ml: നിര്‍ത്തു

source: Store Pictures
ml: ചിത്രങ്ങള്‍ സൂക്ഷിക്കുക

source: System of Measurement
ml: അളവുരീതി

source: Tabs
ml: കിളിവാതിലുകള്‍

source: Temperature
ml: താപനില

source: Templates
ml: മാതൃകകള്‍

source: Text
ml: വാചകം

source: Themes
ml: പ്രമേയങ്ങള്‍

source: Thumbnail View
ml: നഖചിത്ര കാഴ്ച്ച

source: Time Format
ml: സമയ രീതി

source: Time Settings
ml: സമയ ക്രമീകരണങ്ങള്‍

source: Time Zone
ml: സമയമേഘല

source: Time Out
ml: സമയപരിധി കഴിഞ്ഞു

source: Tone Settings
ml: ശബ്ദ ക്രമീകരണങ്ങള്‍

source: Topic Index
ml: വിഷയസൂചിക

source: Topics
ml: വിഷയങ്ങള്‍

source: Total Calls
ml: മൊത്തം വിളികള്‍

source: Tweeter
ml: ട്വീറ്റര്‍

source: Unlock
ml: പൂട്ടു തുറക്കുക

source: Use
ml: ഉപയോഗം

source: Use Details
ml: വിവരങ്ങള്‍ ഉപയോഗിക്കുക

source: Use Image
ml: ചിത്രം ഉപയോഗിക്കുക

source: Use Tone
ml: ശബ്ദം ഉപയോഗിയ്ക്കുക

source: Vibration
ml: വിറയല്‍

source: Video
ml: ചലചിത്രം

source: Video Camera
ml: ചലചിത്ര ക്യാമറ

source: View All
ml: എല്ലാം കാണുക

source: View by Date
ml: തീയതിയനുസരിച്ച് കാണുക

source: View Folder
ml: അറ കാണുക

source: View Saved Message
ml: സൂക്ഷിച്ച സന്ദേശം കാണുക

source: View Slideshow
ml: സ്ലൈഡ്-ഷോ കാണിക്കുക

source: View Today
ml: ഇന്ന് കാണിക്കുക

source: Warning Tones
ml: മുന്നറിയിപ്പു് ശബ്ദങ്ങള്‍

source: Weight
ml: തൂക്കം

source: Welcome Note
ml: സ്വാഗത കുറിപ്പ്

source: Wi-Fi Network
ml: വയര്‍ലെസ് ശൃംഖല

source: Yahoo!
ml: യാഹു!

source: Yes
ml: വേണം

source: YouTube
ml: യൂട്യൂബ്

source: Zoom Mode
ml: വലുതാക്കുന്ന മട്ട്
