Repository: smc/fuel
Catalog: mobile/fuel-mobile-*.po
Languages: ml_rc

source: 12 Hour
ml_rc: 12 മണിക്കൂര്‍

source: 24 Hour
ml_rc: 24 മണിക്കൂര്‍

source: About Application
ml_rc: പ്രയോഗത്തെപ്പറ്റി

source: Accessibility
ml_rc: ലഭ്യത

source: Activate
ml_rc: സജീവമാക്കുക

source: Activate Handset
ml_rc: മൊബൈല്‍ സജീവമാക്കുക

source: Add Bookmark
ml_rc: അടയാളം വയ്ക്കുക

source: Add Contact
ml_rc: പേരു ചേര്‍ക്കുക

source: Add New
ml_rc: പുതിയവ ചേര്‍ക്കൂ

source: Add New Device
ml_rc: പുതിയ ഉപകരണം ചേര്‍ക്കൂ

source: Add to Album
ml_rc: ആല്‍ബത്തില്‍ ചേര്‍ക്കൂ

source: Add to Contact
ml_rc: വിലാസത്തില്‍ ചേര്‍ക്കൂ

source: Add to Home Screen
ml_rc: പൂമുഖത്ത് ചേര്‍ക്കൂ

source: Add to Playlist
ml_rc: പ്ലേലിസ്റ്റില്‍ ചേര്‍ക്കൂ

source: Advanced
ml_rc: കൂടുതല്‍

source: Airplane Mode
ml_rc: വിമാന മോഡ്

source: Alarm Clock
ml_rc: അലാറം

source: Alarm Off
ml_rc: അലാറം ഇല്ല

source: Alarm On
ml_rc: അലാറം ഉണ്ട്

source: Alarm Once
ml_rc: ഒറ്റ അലാറം

source: Alarm Time
ml_rc: അലാറം സമയം

source: Alarm Tone
ml_rc: അലാറം ശബ്ദം

source: Album
ml_rc: ആല്‍ബം

source: All
ml_rc: എല്ലാം

source: All at Once
ml_rc: എല്ലാമൊന്നിച്ച്

source: All Read
ml_rc: എല്ലാം വായിച്ചു

source: All Ringtones
ml_rc: റിങ്ടോണുകള്‍

source: All Songs
ml_rc: എല്ലാ പാട്ടും

source: Answer Call
ml_rc: കോള്‍ എടുക്കൂ

source: Application Manager
ml_rc: പ്രയോഗങ്ങള്‍

source: Area
ml_rc: ഏരിയ

source: Area Code
ml_rc: ഏരിയ കോഡ്

source: Artist
ml_rc: ആര്‍ട്ടിസ്റ്റ്

source: Artists and Albums
ml_rc: ആര്‍ട്ടിസ്റ്റും ആല്‍ബവും

source: Ascending
ml_rc: മേലോട്ട്

source: Auto
ml_rc: തനിയെ

source: Auto-update of Date and Time
ml_rc: ദിവസം, സമയം സ്വയം പുതുക്കുക

source: Automatic
ml_rc: തനിയെ

source: Automatic Keyguard
ml_rc: കീ താനേ പൂട്ടല്‍

source: Automatic Redial
ml_rc: താനേയുള്ള റീഡയല്‍

source: Automatic Retrieval
ml_rc: താനേ വീണ്ടെടുക്കല്‍

source: Back
ml_rc: പിന്നോട്ട്

source: Backlight Timeout
ml_rc: തെളിച്ചം എത്ര നേരം

source: Battery
ml_rc: ബാറ്ററി

source: Beep Once
ml_rc: ഒറ്റ ബീപ്

source: Block Popup
ml_rc: പോപ്പപ് തടയുക

source: Bluetooth
ml_rc: ബ്ലൂട്ടൂത്ത്

source: Bookmarks
ml_rc: അടയാളങ്ങള്‍

source: Brightness
ml_rc: തെളിച്ചം

source: Calculator
ml_rc: കാല്‍ക്കുലേറ്റര്‍

source: Calendar
ml_rc: കലണ്ടര്‍

source: Call Barring
ml_rc: വിളി തടയല്‍

source: Call Divert
ml_rc: വിളി തിരിച്ചുവിടല്‍

source: Call Duration
ml_rc: വിളിയുടെ ദൈര്‍ഘ്യം

source: Call Log
ml_rc: വിളിപ്പട്ടിക

source: Call Settings
ml_rc: വിളിയുടെ ക്രമീകരണം

source: Call Summary
ml_rc: വിളിവിവരം

source: Call Timers
ml_rc: വിളി സമയക്കണക്ക്

source: Call Trackers
ml_rc: വിളി ട്രാക്ക് ചെയ്യല്‍

source: Call Waiting
ml_rc: ദാ, മറ്റൊരു വിളി

source: Camera
ml_rc: ക്യാമറ

source: Cancel
ml_rc: റദ്ദാക്കുക

source: Cancel All Barrings
ml_rc: എല്ലാ വിലക്കും നീക്കുക

source: Capture
ml_rc: പടമെടുക്കുക

source: Carrier
ml_rc: സേവനദാതാവ്

source: Cell Info Display
ml_rc: സെൽ വിവരം കാട്ടുക

source: Change Access Codes
ml_rc: പ്രവേശനകോഡ് മാറ്റുക

source: Change Barring Password
ml_rc: വിലക്കു കോഡ് മാറ്റുക

source: Change Codes
ml_rc: കോഡുകള്‍ മാറ്റുക

source: Change PIN Code
ml_rc: പിന്‍ കോഡ് മാറ്റുക

source: Change Security Codes
ml_rc: സുരക്ഷാ കോഡ് മാറ്റുക

source: Change Wall Paper
ml_rc: പശ്ചാത്തലം മാറ്റുക

source: Chat
ml_rc: ചാറ്റ്

source: Check Status
ml_rc: സ്ഥിതി നോക്കുക

source: Classic Clock
ml_rc: സാദാ ക്ലോക്ക്

source: Clear Counter
ml_rc: കൗണ്ടര്‍ മായ്ക്കുക

source: Clear Log
ml_rc: പട്ടിക മായ്ക്കുക

source: Clear Private Data
ml_rc: സ്വകാര്യവിവരങ്ങള്‍ മായ്ക്കുക

source: Clear Text
ml_rc: ടെക്സ്റ്റ് മായ്ക്കുക

source: Clear Timers
ml_rc: ടൈമര്‍ പൂജ്യമാക്കുക

source: Clock
ml_rc: ക്ലോക്ക്

source: Closed User Group
ml_rc: സ്വകാര്യ യൂസര്‍ഗ്രൂപ്പ്

source: Closeup
ml_rc: ക്ലോസപ്പ്

source: Color Schemes
ml_rc: നിറക്കൂട്ടുകള്‍

source: Compose Email
ml_rc: ഇ-മെയില്‍ എഴുതുക

source: Compose Text Message
ml_rc: സന്ദേശമെഴുതുക

source: Conference Call
ml_rc: കൂട്ടു വിളി

source: Confirm
ml_rc: ഉറപ്പാക്കുക

source: Confirm Delivery
ml_rc: കിട്ടിയെന്നുറപ്പാക്കുക

source: Confirm Read
ml_rc: വായിച്ചെന്നുറപ്പാക്കുക

source: Confirm SIM Service Action
ml_rc: സിം സേവനം ഉറപ്പാക്കുക

source: Confirmations
ml_rc: ഉറപ്പാക്കലുകള്‍

source: Contact Images
ml_rc: ആളുടെ ചിത്രം

source: Contact Name
ml_rc: പേര്

source: Contacts
ml_rc: വിലാസങ്ങള്‍

source: Converter
ml_rc: കണ്‍വര്‍ട്ടര്‍

source: Copy
ml_rc: പകര്‍ത്തുക

source: Copy Location
ml_rc: സ്ഥാനം പകര്‍ത്തുക

source: Cost Control
ml_rc: ചെലവുചുരുക്കല്‍

source: Cost Settings
ml_rc: ചെലവു ക്രമീകരണം

source: Create Message
ml_rc: സന്ദേശം എഴുതുക

source: Currency
ml_rc: കറന്‍സി

source: Data Services
ml_rc: ഡാറ്റ സേവനങ്ങള്‍

source: Date Setting
ml_rc: തീയതി ക്രമീകരണം

source: Default
ml_rc: സ്വതേയുള്ള

source: Default Call Volume
ml_rc: വിളിയുടെ സ്വതേയുള്ള ഒച്ച

source: Default Font Size
ml_rc: സ്വതേയുള്ള അക്ഷരവലിപ്പം

source: Default Text Encoding
ml_rc: സ്വതേയുള്ള ടെക്സ്റ്റ് എൻകോഡിങ്ങ്

source: Delete
ml_rc: കളയുക

source: Delete Messages
ml_rc: സന്ദേശങ്ങള്‍ കളയുക

source: Delete Recent Call Lists
ml_rc: വിളിപ്പട്ടിക കളയുക

source: Delivery Reports
ml_rc: എത്തിയ വിവരം

source: Device Update
ml_rc: സോഫ്‌‌റ്റ്‌‌വെയര്‍ പുതുക്കല്‍

source: Dialed
ml_rc: ഞാന്‍ വിളിച്ചത്

source: Dialed Numbers
ml_rc: ഞാന്‍ വിളിച്ചവര്‍

source: Dictionary
ml_rc: നിഘണ്ടു

source: Dictionary Off
ml_rc: നിഘണ്ടു വേണ്ട

source: Digital Clock
ml_rc: ഡിജിറ്റല്‍ ക്ലോക്ക്

source: Digital Zoom
ml_rc: ഡിജിറ്റല്‍ സൂം

source: Discoverable
ml_rc: കണ്ടെത്താവുന്ന

source: Discreet
ml_rc: സവിവേകം

source: Display Detail
ml_rc: വിശദാംശം കാണിക്കുക

source: Display Language
ml_rc: കാണേണ്ട ഭാഷ

source: Display Settings
ml_rc: കാഴ്ച ക്രമീകരണം

source: Distribution List
ml_rc: വിതരണപ്പട്ടിക

source: Divert All Voice Calls
ml_rc: വിളികള്‍ തിരിച്ചുവിടുക

source: Download Image Automatically
ml_rc: ചിത്രം താനേ ഡൗണ്‍ലോഡ് ചെയ്യുക

source: Drafts
ml_rc: അയയ്ക്കാത്തവ

source: Duration
ml_rc: ദൈര്‍ഘ്യം

source: Duration of All Calls
ml_rc: ആകെ വിളികളുടെ ദൈര്‍ഘ്യം

source: Duration of Dialed Calls
ml_rc: എന്റെ വിളികളുടെ ദൈര്‍ഘ്യം

source: Duration of Last Calls
ml_rc: ഒടുവിലത്തെ വിളിയുടെ ദൈര്‍ഘ്യം

source: Duration of Received Calls
ml_rc: എടുത്ത വിളികളുടെ ദൈര്‍ഘ്യം

source: Edit
ml_rc: തിരുത്തുക

source: Email Account Management
ml_rc: ഇ-മെയില്‍ അക്കൗണ്ടുകള്‍

source: Email Filters
ml_rc: ഇ-മെയില്‍ അരിപ്പ

source: Enable Bluetooth
ml_rc: ബ്ലൂട്ടൂത്ത് സജീവമാക്കുക

source: Enable Geo Location
ml_rc: ജിയോ ലൊക്കേഷൻ സജീവമാക്കുക

source: Enable HTML Email
ml_rc: HTML ഇമെയില്‍ സജീവമാക്കുക

source: Encryption
ml_rc: എന്‍ക്രിപ്ഷന്‍

source: Enhancement
ml_rc: സഹായകം

source: Enhancement Settings
ml_rc: സഹായക ക്രമീകരണങ്ങൾ

source: Enter PIN Code
ml_rc: പിന്‍ കോഡ് നല്‍കുക

source: Enter Recipient
ml_rc: അയയ്ക്കേണ്ട വിലാസം

source: Equalizer
ml_rc: ഈക്വലൈസർ

source: Erase All Contents and Settings
ml_rc: എല്ലാ ഉള്ളടക്കവും ക്രമീകരണവും മായ്ക്കുക

source: Events Notified
ml_rc: അറിയിച്ച സംഭവങ്ങള്‍

source: Exit
ml_rc: പുറത്തിറങ്ങുക

source: Exit Editor
ml_rc: തിരുത്തല്‍ മതിയാക്കുക

source: Extra Large Fonts
ml_rc: വളരെ വലിയ അക്ഷരങ്ങള്‍

source: Extras
ml_rc: മറ്റുള്ളവ

source: Facebook
ml_rc: ഫേസ്ബുക്ക്

source: Files
ml_rc: ഫയലുകള്‍

source: File Manager
ml_rc: ഫയല്‍ കൈകാര്യം

source: Find Location
ml_rc: സ്ഥാനം കണ്ടെത്തുക

source: Firewall
ml_rc: സുരക്ഷാകവചം

source: Fixed Dialing
ml_rc: നിശ്ചിത ഡയലിങ്ങ്

source: Flash
ml_rc: ഫ്ലാഷ്

source: Flash Light
ml_rc: ടോര്‍ച്ച്

source: FM Transmitter
ml_rc: എഫ്.എം. പ്രസരണി

source: Font Size
ml_rc: അക്ഷരവലിപ്പം

source: Format
ml_rc: ഫോര്‍മാറ്റ് ചെയ്യുക

source: Forward
ml_rc: കൈമാറുക

source: Free Memory
ml_rc: മിച്ചമെമ്മറി

source: Full
ml_rc: നിറഞ്ഞു

source: Game Sound
ml_rc: ഗെയിം ഒച്ച

source: Games
ml_rc: കളികള്‍

source: General
ml_rc: സാധാരണം

source: Genres
ml_rc: വിഭാഗങ്ങള്‍

source: Get Directions
ml_rc: ദിശ കാട്ടുക

source: Go to
ml_rc: പോവുക

source: Go to Date
ml_rc: തീയതിയിലേയ്ക്ക്

source: Go to Music Store
ml_rc: മ്യൂസിക്ക്സ്റ്റോറിലേയ്ക്ക്

source: Google
ml_rc: ഗൂഗിള്‍

source: Grid View
ml_rc: ഗ്രിഡ് ദൃശ്യം

source: Handsfree
ml_rc: ഹാൻഡ്സ് ഫ്രീ

source: Headset
ml_rc: ഹെഡ്സെറ്റ്

source: Hide Clock
ml_rc: ക്ലോക്ക് മറയ്ക്കുക

source: History
ml_rc: നാൾവഴി

source: Home
ml_rc: പൂമുഖം

source: Image Size
ml_rc: ചിത്രത്തിന്റെ വലിപ്പം

source: Import Pictures
ml_rc: ചിത്രങ്ങള്‍ കൊണ്ടുവരിക

source: In Car
ml_rc: കാറില്‍

source: In-call Timer
ml_rc: വിളിയുടെ തത്സമയദൈര്‍ഘ്യം

source: Inbox
ml_rc: ഇന്‍ബോക്സ്

source: In-call Settings
ml_rc: വരുന്ന വിളികളുടെ ക്രമീകരണങ്ങൾ

source: Include Signature
ml_rc: ഒപ്പ് ചേര്‍ക്കുക

source: Incoming Calls
ml_rc: വന്ന വിളികള്‍

source: Info Service
ml_rc: സ്ഥല-വിവര സേവനം

source: Insert Number
ml_rc: അക്കം ചേര്‍ക്കുക

source: Insert Options
ml_rc: ഉള്‍പ്പെടുത്തല്‍ സൗകര്യങ്ങള്‍

source: Insert Smiley
ml_rc: സ്മൈലി ചേര്‍ക്കുക

source: Insert Symbol
ml_rc: ചിഹ്നം ചേര്‍ക്കുക

source: Insert Template
ml_rc: രൂപമാതൃക ചേര്‍ക്കുക

source: Installation Files
ml_rc: ഇന്‍സ്റ്റലേഷ‌‌ന്‍ ഫയലുകള്‍

source: Installation Settings
ml_rc: ഇന്‍സ്റ്റലേഷ‌‌ന്‍ ക്രമീകരണങ്ങള്‍

source: Installed Apps
ml_rc: ഇന്‍സ്റ്റാളുചെയ്ത പ്രയോഗങ്ങള്‍

source: Instructions
ml_rc: നിര്‍ദ്ദേശങ്ങള്‍

source: International Calls
ml_rc: രാജ്യാന്തരവിളികള്‍

source: IP Address
ml_rc: ഐപി വിലാസം

source: Keyguard Code
ml_rc: കീപ്പൂട്ട് കോഡ്

source: Keyguard Settings
ml_rc: കീപ്പൂട്ട് ക്രമീകരണങ്ങള്‍

source: Keylock
ml_rc: കീപ്പൂട്ട്

source: Keypad Active
ml_rc: കീപാഡ് സജീവം

source: Keypad Locked
ml_rc: കീപാഡ് പൂട്ടിയിരിക്കുന്നു

source: Keypad Tones
ml_rc: കീപാഡ് ശബ്ദങ്ങള്‍

source: Keypad Unlocked
ml_rc: കീപാഡ് തുറന്നു

source: Landscape
ml_rc: കുറുകെ

source: Language
ml_rc: ഭാഷ

source: Large Fonts
ml_rc: വലിയ അക്ഷരങ്ങള്‍

source: Last Call
ml_rc: ഒടുവിലത്തെ വിളി

source: Last Watched
ml_rc: ഒടുവില്‍ കണ്ടത്

source: Latest Update
ml_rc: ഒടുവില്‍ പുതുക്കിയത്

source: Length
ml_rc: ദൂരം

source: Lights Only
ml_rc: പ്രകാശം മാത്രം

source: List
ml_rc: പട്ടിക

source: List View
ml_rc: പട്ടികദൃശ്യം

source: Load Image
ml_rc: ചിത്രം ലോഡ് ചെയ്യുക

source: Location
ml_rc: സ്ഥാനം

source: Location Services
ml_rc: സ്ഥാനപര സേവനങ്ങള്‍

source: Lock
ml_rc: പൂട്ടുക

source: Loud
ml_rc: ഉച്ചത്തില്‍

source: Loudness
ml_rc: ശബ്ദതീവ്രത

source: Manual
ml_rc: മാന്വല്‍

source: Maps
ml_rc: ഭൂപടങ്ങള്‍

source: Media
ml_rc: മീഡിയ

source: Media Player
ml_rc: മീഡിയ പ്ലെയര്‍

source: Meeting
ml_rc: മീറ്റിങ്

source: Memory Status
ml_rc: മെമ്മറിയുടെ നില

source: Menu
ml_rc: മെനു

source: Menu View
ml_rc: മെനു ദൃശ്യം

source: Message Alert Tone
ml_rc: സന്ദേശശബ്ദം

source: Message Counter
ml_rc: സന്ദേശത്തിന്റെ എണ്ണം

source: Message Notifiers
ml_rc: സന്ദേശ അറിയിപ്പുകള്‍

source: Message Saved
ml_rc: സന്ദേശം സൂക്ഷിച്ചു

source: Message Settings
ml_rc: സന്ദേശക്രമീകരണങ്ങള്‍

source: Messages
ml_rc: സന്ദേശങ്ങള്‍

source: Missed
ml_rc: എടുക്കാത്തവ

source: Missed Calls
ml_rc: എടുക്കാത്ത വിളികള്‍

source: MMS
ml_rc: മൾട്ടിമീഡിയ സന്ദേശം

source: Mobile Network
ml_rc: മൊബൈല്‍ ശൃംഖല

source: Model
ml_rc: മോഡല്‍

source: More
ml_rc: കൂടുതല്‍

source: Music Library
ml_rc: സംഗീതശേഖരം

source: Music Player
ml_rc: പാട്ടുപെട്ടി

source: My Location
ml_rc: എന്റെ സ്ഥാനം

source: Name
ml_rc: പേരു്

source: Name and Number
ml_rc: പേരും നമ്പരും

source: Name List
ml_rc: പേരുപട്ടിക

source: Name Only
ml_rc: പേരു മാത്രം

source: Navigate to Here
ml_rc: ഇവിടേയ്ക്കുള്ള വഴി

source: Network and Connection
ml_rc: ശൃംഖലയും കണക്‌‌ഷനും

source: Network Selection
ml_rc: ശൃംഖല തെരഞ്ഞെടുക്കല്‍

source: New Appointment
ml_rc: പുതിയ പരിപാടി

source: Next
ml_rc: അടുത്തത്

source: Night
ml_rc: രാത്രി

source: No
ml_rc: വേണ്ട

source: No Screening
ml_rc: പരിശോധന വേണ്ട

source: None
ml_rc: ഒന്നുമില്ല

source: Normal
ml_rc: സാധാരണ

source: Note
ml_rc: കുറിപ്പ്

source: Notification Lights
ml_rc: അറിയിപ്പുവിളക്കുകള്‍

source: Now Playing...
ml_rc: ഇപ്പോള്‍ ഓടുന്നത്...

source: Now Press *
ml_rc: ഇനി * അമര്‍ത്തുക

source: Number of Copies
ml_rc: പകര്‍പ്പുകളുടെ എണ്ണം

source: Numbers
ml_rc: നമ്പറുകള്‍

source: Office
ml_rc: കാര്യാലയം

source: OK
ml_rc: ശരി

source: On
ml_rc: ഓണ്‍

source: One by One
ml_rc: ഒന്നൊന്നായി

source: Options
ml_rc: സാധ്യതകള്‍

source: Organize
ml_rc: ക്രമീകരിക്കുക

source: Other Video Clips
ml_rc: മറ്റു വീഡിയോശകലങ്ങള്‍

source: Outdoors
ml_rc: പുറം

source: Outgoing Calls
ml_rc: പുറത്തേക്കുള്ള വിളികള്‍

source: Passcode Lock
ml_rc: രഹസ്യവാക്കുള്ള പൂട്ട്

source: Password
ml_rc: രഹസ്യവാക്ക്

source: Paste
ml_rc: ഒട്ടിക്കുക

source: Phone
ml_rc: ഫോണ്‍

source: Phone Management
ml_rc: ഫോണ്‍ കൈകാര്യം

source: Phone Number
ml_rc: ഫോണ്‍ നമ്പര്‍

source: Phone Settings
ml_rc: ഫോണ്‍ ക്രമീകരണങ്ങള്‍

source: Phone-book Style
ml_rc: ഫോണ്‍ബുക്ക് രീതി

source: Picture Messages
ml_rc: ചിത്രസന്ദേശങ്ങള്‍

source: Picture Review
ml_rc: ചിത്രാവലോകനം

source: PIN Code Request
ml_rc: PIN കോഡ് ചോദിക്കുക

source: Play
ml_rc: പ്ലേ ചെയ്യുക

source: Playlists
ml_rc: പ്ലേലിസ്റ്റ്

source: Please Call
ml_rc: ഒന്നെന്നെ വിളിക്കാമോ?

source: Podcast
ml_rc: പോഡ്കാസ്റ്റ്

source: Portrait
ml_rc: നെടുകെ

source: Power Off
ml_rc: ഓഫാക്കുക

source: Power Saving
ml_rc: ഊര്‍ജ്ജം ലാഭിക്കല്‍

source: Prepaid Credit
ml_rc: പ്രീപെയ്ഡ് ബാലന്‍സ്

source: Previous
ml_rc: മുമ്പത്തെ

source: Print
ml_rc: അച്ചടിക്കൂ

source: Product Code
ml_rc: ഉല്‍പന്ന കോഡ്

source: Profile
ml_rc: പ്രൊഫൈല്‍

source: Properties
ml_rc: സവിശേഷതകള്‍

source: Quit
ml_rc: അടയ്ക്കുക

source: Radio
ml_rc: റേഡിയോ

source: Read
ml_rc: വായിക്കുക

source: Received
ml_rc: കിട്ടിയവ

source: Received Calls
ml_rc: വന്ന വിളികള്‍

source: Received Messages
ml_rc: കിട്ടിയ സന്ദേശങ്ങള്‍

source: Recently Visited Page
ml_rc: ഈയടുത്ത് സന്ദര്‍ശിച്ച താള്‍

source: Reduced
ml_rc: ചുരുക്കിയത്

source: Refresh Library
ml_rc: ശേഖരം പുതുക്കുക

source: Remind About
ml_rc: ഓർമ്മിപ്പിക്കുക

source: Reminders
ml_rc: ഓര്‍മ്മപ്പെടുത്തലുകള്‍

source: Remove from Album
ml_rc: ആല്‍ബത്തില്‍നിന്ന് നീക്കുക

source: Repeat
ml_rc: ആവര്‍ത്തിക്കുക

source: Repeat Alarm
ml_rc: അലാറം ആവര്‍ത്തിക്കുക

source: Repeat All
ml_rc: എല്ലാം ആവര്‍ത്തിക്കുക

source: Repeat Song
ml_rc: പാട്ട് ആവര്‍ത്തിക്കുക

source: Reply
ml_rc: മറുപടി

source: Reply to All
ml_rc: എല്ലാവര്‍ക്കും മറുപടി

source: Reset All Settings
ml_rc: എല്ലാ ക്രമീകരണവും പഴയപോലാക്കുക

source: Reset Home Screen Layout
ml_rc: പൂമുഖം പഴയപോലെ വിന്യസിക്കുക

source: Reset Keyboard Dictionary
ml_rc: കീബോഡ് നിഘണ്ടു പുനഃക്രമീകരിക്കുക

source: Reset Location Warning
ml_rc: സ്ഥാനമുന്നറിയിപ്പു് പുനഃക്രമീകരിക്കുക

source: Reset Network Settings
ml_rc: ശൃംഖല പുനഃക്രമീകരിക്കുക

source: Reset Settings
ml_rc: ക്രമീകരണങ്ങള്‍ പഴയപോലാക്കുക

source: Resolution
ml_rc: റെസല്യൂഷന്‍

source: Restore Factory Settings
ml_rc: ഫാക്ടറിക്രമീകരണം ആക്കുക

source: Right Selection Key
ml_rc: വലതു സെലക്‌‌ഷന്‍ കീ

source: Ringing Tone
ml_rc: റിങ് ടോണ്‍

source: Ringing Volume
ml_rc: റിങ്ങിങ് ഒച്ച

source: Save
ml_rc: സൂക്ഷിക്കുക

source: Save Message
ml_rc: സന്ദേശം സൂക്ഷിക്കുക

source: Screen Display
ml_rc: സ്ക്രീന്‍ കാഴ്ച

source: Screen Rotation
ml_rc: സ്ക്രീന്‍ തിരിക്കല്‍

source: Screen Saver
ml_rc: സ്ക്രീന്‍ സേവര്‍

source: Screened Messages
ml_rc: പരിശോധിച്ച സന്ദേശങ്ങള്‍

source: Search
ml_rc: തെരയുക

source: Search by
ml_rc: തിരയേണ്ട അടിസ്ഥാനം

source: Search by Sender
ml_rc: അയച്ചയാളെ വച്ച് തെരയുക

source: Search by Subject
ml_rc: വിഷയം വച്ച് തെരയുക

source: Security
ml_rc: സുരക്ഷ

source: Security Codes
ml_rc: സുരക്ഷാകോഡുകള്‍

source: Security Levels
ml_rc: സുരക്ഷാതലങ്ങള്‍

source: Security Settings
ml_rc: സുരക്ഷാക്രമീകരണങ്ങള്‍

source: Select
ml_rc: തെരഞ്ഞെടുക്കുക

source: Select Option
ml_rc: സാധ്യത തെരഞ്ഞെടുക്കുക

source: Send
ml_rc: അയയ്ക്കുക

source: Send Contact Card
ml_rc: വിലാസക്കാര്‍ഡ് അയയ്ക്കുക

source: Send Later
ml_rc: പിന്നെ അയയ്ക്കുക

source: Send Location
ml_rc: സ്ഥാനം അയയ്ക്കുക

source: Send to List
ml_rc: പട്ടികയിലേക്ക് അയയ്ക്കുക

source: Send to Many
ml_rc: പലര്‍ക്ക് അയയ്ക്കുക

source: Sender
ml_rc: അയച്ചയാള്‍

source: Sending Options
ml_rc: എങ്ങനെ അയയ്ക്കണം

source: Sending Profile
ml_rc: അയയ്ക്കല്‍ പ്രൊഫൈല്‍

source: Sensor Settings
ml_rc: സെന്‍സര്‍ ക്രമീകരണങ്ങള്‍

source: Sent
ml_rc: അയച്ചവ

source: Sent Items
ml_rc: അയച്ച ഇനങ്ങള്‍

source: Sent Messages
ml_rc: അയച്ച സന്ദേശങ്ങള്‍

source: Service Center
ml_rc: സേവനകേന്ദ്രം

source: Service Not Active
ml_rc: സേവനം സജീവമല്ല

source: Service Status
ml_rc: സേവനത്തിന്റെ നില

source: Set as Ring Tone
ml_rc: റിങ്ടോണാക്കുക

source: Set the Time
ml_rc: സമയം ശരിയാക്കുക

source: Settings
ml_rc: ക്രമീകരണങ്ങള്‍

source: Setup
ml_rc: സജ്ജമാക്കുക

source: Shuffle
ml_rc: ഇടകലര്‍ത്തുക

source: Shuffle Play
ml_rc: ഇടകലര്‍ത്തി ഓടിക്കുക

source: Shutdown
ml_rc: അടച്ചുപൂട്ടുക

source: Signal
ml_rc: സിഗ്നല്‍

source: Signature
ml_rc: ഒപ്പ്

source: Silent
ml_rc: നിശ്ശബ്ദം

source: SIM Card
ml_rc: സിം കാര്‍ഡ്

source: Slide Show
ml_rc: സ്ലൈഡ് ഷോ

source: Small Fonts
ml_rc: ചെറിയ അക്ഷരങ്ങള്‍

source: Smart Dialing
ml_rc: സ്മാര്‍ട്ട് ഡയലിങ്

source: Smileys
ml_rc: സ്മൈലികള്‍

source: SMS
ml_rc: എസ്എംഎസ്

source: Software Update
ml_rc: സോഫ്റ്റ്‌വെയര്‍ പുതുക്കല്‍

source: Software Version
ml_rc: സോഫ്റ്റ്‌വെയര്‍ പതിപ്പ്

source: Song Details
ml_rc: പാട്ടുവിവരങ്ങള്‍

source: Songs
ml_rc: പാട്ടുകള്‍

source: Sound and Ringtone
ml_rc: ശബ്ദവും റിങ്ടോണും

source: Speaking
ml_rc: സംസാരിക്കുന്നു

source: Special
ml_rc: സവിശേഷം

source: Speed Dialing
ml_rc: വേഗ ഡയല്‍

source: Spell Check
ml_rc: അക്ഷരത്തെറ്റു നോട്ടം

source: Sports
ml_rc: കായികം

source: Spreadsheet
ml_rc: സ്പ്രെഡ്ഷീറ്റ്

source: Standard
ml_rc: മാനകം

source: Start
ml_rc: തുടങ്ങുക

source: Startup Tone
ml_rc: തുടങ്ങുന്ന ശബ്ദം

source: Startup Page
ml_rc: ആദ്യതാള്‍

source: Stereo Widening
ml_rc: സ്റ്റീരിയോ വൈഡനിങ്

source: Stop
ml_rc: നിര്‍ത്തുക

source: Stop Watch
ml_rc: സ്റ്റോപ് വാച്ച്

source: Store Pictures
ml_rc: ചിത്രങ്ങള്‍ സൂക്ഷിക്കുക

source: Switch Application
ml_rc: പ്രയോഗം മാറ്റുക

source: System of Measurement
ml_rc: അളവുരീതി

source: Tabs
ml_rc: ടാബുകള്‍

source: Temperature
ml_rc: താപനില

source: Templates
ml_rc: രൂപമാതൃകകള്‍

source: Text
ml_rc: ടെക്സ്റ്റ്

source: Themes
ml_rc: പ്രമേയങ്ങള്‍

source: Thumbnail View
ml_rc: നഖച്ചിത്രക്കാഴ്ച്ച

source: Time Format
ml_rc: സമയരീതി

source: Time Settings
ml_rc: സമയക്രമീകരണങ്ങള്‍

source: Time Zone
ml_rc: സമയമേഖല

source: Time Out
ml_rc: സമയം കഴിഞ്ഞു

source: Tone Settings
ml_rc: ശബ്ദക്രമീകരണങ്ങള്‍

source: Topic Index
ml_rc: വിഷയസൂചിക

source: Topics
ml_rc: വിഷയങ്ങള്‍

source: Total Calls
ml_rc: മൊത്തം വിളികള്‍

source: Tweeter
ml_rc: ട്വീറ്റര്‍

source: Unlock
ml_rc: പൂട്ടു തുറക്കുക

source: Use
ml_rc: ഉപയോഗിക്കുക

source: Use Details
ml_rc: വിവരങ്ങള്‍ ഉപയോഗിക്കുക

source: Use Image
ml_rc: ചിത്രം ഉപയോഗിക്കുക

source: Use Tone
ml_rc: ശബ്ദം ഉപയോഗിക്കുക

source: User Guide
ml_rc: ഉപയോഗസഹായി

source: Vibrate then Ring
ml_rc: തുടിച്ചശേഷം ശബ്ദിക്കുക

source: Vibrating Alert
ml_rc: തുടിച്ചറിയിക്കല്‍

source: Vibration
ml_rc: തുടിക്കല്‍

source: Video
ml_rc: വീഡിയോ

source: Video Camera
ml_rc: വീഡിയോ ക്യാമറ

source: View All
ml_rc: എല്ലാം കാണുക

source: View by Date
ml_rc: തീയതിക്രമത്തില്‍ കാണുക

source: View Folder
ml_rc: അറ കാണുക

source: View Saved Message
ml_rc: സൂക്ഷിച്ച സന്ദേശം കാണുക

source: View Slideshow
ml_rc: സ്ലൈഡ്ഷോ കാണിക്കുക

source: View Today
ml_rc: ഇന്നത്തെ പരിപാടികള്‍

source: Voice Mail Box Number
ml_rc: വോയ്സ് മെയില്‍ബോക്സ് നമ്പര്‍

source: Warning Tones
ml_rc: മുന്നറിയിപ്പുശബ്ദങ്ങള്‍

source: Weight
ml_rc: ഭാരം

source: Welcome Note
ml_rc: സ്വാഗതവചനം

source: Wi-Fi Network
ml_rc: വയര്‍ലെസ് ശൃംഖല

source: Yahoo!
ml_rc: യാഹൂ!

source: Yes
ml_rc: വേണം

source: YouTube
ml_rc: യൂട്യൂബ്

source: Zoom Mode
ml_rc: സൂം മട്ട്
